# -*- coding: utf-8 -*-

vacancy1 = u'''
Senior Python Developer, Team Lead / Architect
36000 грн.
Компания:HEX | Human EXperts
Все вакансии этой компанииКонтактное лицо:ВолодимирТелефон:(44) 383.11.87Город:КиевВид занятости:полная занятость
Требования к соискателю

опыт работы от 2 лет
высшее образование
от 23 лет
Описание вакансии

Рекрутингова компанія HEX | Human EXperts спеціалізується на пошуку фахівців за напрямками «Інформаційні технології» та «Телекомунікації». Наразі для свого клієнта — розробника систем веб-аналітики — ми шукаємо тім-ліда і декількох Senior Python розробників.



Код вакансії: 001081

Місто: Київ

З/п: 2500$ - 4500$



Загальні вимоги:


Від 23 років;
Досвід роботи у динамічному середовищі;
Повна вища освіта (інформатика або прикладна математика);
Володіння англійською мовою на рівні читання документації.


Професійні вимоги:



Добра підготовка з теорії алгоритмів;
Впевнене володіння ООП, знання патернів проектування;
Розробка ПЗ для веб – більше 5-и років;
Побудова архітектури веб-проектів – більше 2-х років;
Розробка високонавантажених веб-проектів – більше 2-х років;
Досвід роботи з Python – більше 2-х років;
Досвід роботи з Django – більше 1-го року;
Глибоке розуміння принципів побудови реляційних БД;
Досвід роботи з NoSQL (MongoDB, Redis);
На достатньому рівні володіння технологіями для Front-end;
Всебічний досвід роботи з технологіями AJAX, Comet;
Cтворення структурованого чистого коду, досвід роботи з чужим кодом;
Досвід ведення проектної документації;
Знання принципів гнучкої методології розробки;
Досвід управління командою розробників – від 1-го року;


Додаткові плюси:


Досвід роботи з API соціальних мереж;
Досвід розробки систем веб-аналітики;
Досвід розробки інструментів для верстки та її автоматизації;
Досвід розробки комплексних проектів на PHP або серверному JavaScript (Node.js);
Наявність сертифікатів.


Задачі:


Тісне спілкування з керівниками проекту, формування технічних завдань;
Дослідження і розробка архітектури високонавантаженого веб-орієнтованого ПЗ;
Розробка архітектури комплексних сервісів, внутрішніх і зовнішніх API;
Створення і подальше ведення проектної документації ;
Участь в розробці ПЗ у якості провідного спеціаліста;
Управління процесом розробки і роботою команди;


Особисті якості:



Високий рівень самоорганізації та цілеспрямованості;
Креативність, схильність до творчого підходу в роботі;
Вміння аргументовано відстоювати свої ідеї;
Комунікабельність і доброзичливість;
Сумлінність і відповідальність.


Умови роботи:



Цікаві складні проекти;
Висока стабільна заробітна платня (2500$-4500$);
Оплачувана відпустка та лікарняні;
Затишний сучасний офіс біля метро (м. Деміївська);
Розвинена корпоративна культура;
Дружня молода (середній вік ~25 р.) міжнародна команда;
Повний робочий день із гнучким графіком.


Резюме надсилайте на адресу [отправить резюме].



Для пошукачів послуги є безкоштовними.

Щодо кожного звернення зберігається конфіденційність.



P. S.       Можливо, ви маєте знайомих, яким була б цікава ця вакансія? Ми пропонуємо бонус у розмірі 10% від нашого гонорару за рекомендацію спеціаліста, якого буде нами працевлаштовано.


'''

vacancy2 = u'''
Junior Python Developer
Компания:ENAPPS
Все вакансии этой компанииГород:ЛьвовВид занятости:полная занятость
Требования к соискателю

высшее образование
Описание вакансии

Enapps is a UK based dynamic company that specialises in development and implementations of ERP and accounting systems. To support the growth, we are seeking a Junior Python Developer to join our Lviv team on a permanent basis.



Job Title: Junior Python Developer

Hours: Full time

Work base: Lviv, Ukraine

Main Responsibilities:

Develop; test and review python objected oriented modules to work as a complete business solution.
Build, install, automate, patch and backup Linux-based servers.
Provide technical assistance and debugging to English speaking clients.
Engage in continuous systems improvement.


Key skills and qualities:

Strong logic and problem-solving skills.
Trustworthy and reliable.
Attention to detail and accuracy.
Time management, planning and organising.
Information and task monitoring.
Strong work ethic and a sense of urgency in solving problems.
Experience / Qualifications

University Degree.
Good English.
Python knowledge.
Knowledge of Linux automations.
Comfortable with SQL.


To apply: send your CV and covering letter to - [отправить резюме]


'''


vacancies = [('vacancy1', vacancy1), ('vacancy2', vacancy2)]